Revit 2016 API
LineLoad.UniformLoad Property
 Indicates if the load is uniform.
Namespace: Autodesk.Revit.DB.Structure
Assembly: RevitAPI (in RevitAPI.dll) Version: 16.0.0.0 (16.0.0.0)
Syntax
C#
[ObsoleteAttribute("This property is deprecated in Revit 2016. Use IsUniform instead.")]
public bool UniformLoad { get; }
Visual Basic
<ObsoleteAttribute("This property is deprecated in Revit 2016. Use IsUniform instead.")> _
Public ReadOnly Property UniformLoad As Boolean
	Get
Visual C++
[ObsoleteAttribute(L"This property is deprecated in Revit 2016. Use IsUniform instead.")]
public:
property bool UniformLoad {
	bool get ();
}
Remarks
 Returns true if the line load is uniform, false otherwise. Load is uniform when force and moment vectors assigned to the start and the end point of load are equal.
See Also
LineLoad Class
Autodesk.Revit.DB.Structure Namespace